app/views/recipes/_form.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags".id = "taggings".tag_id WHERE (("taggings".taggable_id = NULL) AND ("taggings".taggable_type = 'Recipe')) AND (taggings.context = 'tags' AND taggings.tagger_id IS NULL)
---
	<div class="ui-widget">
	<p><%= f.label :tag_list, "Tag it" %><%= f.text_field :tag_list, "data-pre" => @recipe.tags.map(&:attributes).to_json %></p>