app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.search(params[:search])
                     .with_ingredients(params[:with])
                     .with_ingredients(params[:without], :exclude => true)
                     .page(params[:page]).per(5)
                     .includes(:ingredients, :user, :tags)
---
SELECT "ingredients".* FROM "ingredients" WHERE (name LIKE '%poulet%' OR name LIKE '%citron%' OR name LIKE '%pastis%')
SELECT "users".* FROM "users" WHERE ("users"."id" IN (1,2,3))
SELECT COUNT(*) FROM "recipes" JOIN recipes_ingredients recipes_ingredients_Poivre_838 ON recipes_ingredients_Poivre_838.recipe_id = recipes.id AND recipes_ingredients_Poivre_838.ingredient_id = 10 WHERE (recipes.id NOT IN (SELECT recipes_ingredients.recipe_id FROM recipes_ingredients JOIN ingredients ON recipes_ingredients.ingredient_id = ingredients.id AND (ingredients.name LIKE 'sel')))
SELECT recipes.* FROM "recipes" JOIN recipes_ingredients recipes_ingredients_Poivre_838 ON recipes_ingredients_Poivre_838.recipe_id = recipes.id AND recipes_ingredients_Poivre_838.ingredient_id = 10 WHERE (recipes.id NOT IN (SELECT recipes_ingredients.recipe_id FROM recipes_ingredients JOIN ingredients ON recipes_ingredients.ingredient_id = ingredients.id AND (ingredients.name LIKE 'sel'))) LIMIT 5 OFFSET 0

  def create
    @recipe =      current_user.recipes.build(@recipe_params)
    @ingredients = @recipe_params[:ingredients]
    flash[:notice] = "Your recipe has been added" if @recipe.save!
---
INSERT INTO "recipes" ("name", "content", "created_at", "updated_at", "user_id") VALUES ('Socca niçoise au four', 'Dans un saladier profond, mettez l''eau froide et y délayer au fouet la farine de pois chiches.

  def update
    flash[:notice] = "Recipe successfully updated" if @recipe.update_attributes(@recipe_params)
---
UPDATE "recipes" SET "content" = 'Mélanger le tout ', "updated_at" = '2011-05-01 15:33:35.828881' WHERE "recipes"."id" = 2

  def destroy
    flash[:notice] = "Recipe successfully deleted" if @recipe.destroy
---
DELETE FROM "recipes" WHERE "recipes"."id" = 2

  def load_recipe
    @recipe = Recipe.find(params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = 3 ORDER BY created_at LIMIT 1