app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."login" = 'jinr0h' LIMIT 1
---
  def show
    @user = User.find_by_login( params[:login] )